#include <stdio.h>     //Необходимые библиотеки
#include <locale.h>
#include <stdlib.h>
#include <time.h>
#include <string.h>

// Глобальные переменные для координат
int x, y;

// Прототипы функций
void level1(char matrix[10][10]);
int level2(char matrix[10][10]);
void level3(char matrix[10][10]);
int isSafe(char matrix[10][10], int row, int col);
void level4(char matrix[10][10]);
void levelchoice();
int win();
int changes();
void writ();

// Создание рабочего игрового поля
char field[10][10] = {
   {'_','_','_','_','_','_','_','_','_','_'},
   {'_','_','_','_','_','_','_','_','_','_'},
   {'_','_','_','_','_','_','_','_','_','_'},
   {'_','_','_','_','_','_','_','_','_','_'},
   {'_','_','_','_','_','_','_','_','_','_'},
   {'_','_','_','_','_','_','_','_','_','_'},
   {'_','_','_','_','_','_','_','_','_','_'},
   {'_','_','_','_','_','_','_','_','_','_'},
   {'_','_','_','_','_','_','_','_','_','_'},
   {'_','_','_','_','_','_','_','_','_','_'},
};

//  Базовое поле для level1
char stanfield[10][10]= {
	 {'0','_','_','0','_','0','_','_','0','_'},
	 {'_','_','_','_','_','_','_','_','_','_'},
	 {'0','_','0','_','_','_','_','0','_','0'},
	 {'_','_','_','0','_','0','_','_','_','_'},
	 {'_','_','_','_','_','_','_','_','_','0'},
	 {'0','_','_','_','_','0','_','_','_','_'},
	 {'_','_','0','_','0','_','_','0','_','_'},
	 {'0','_','_','_','_','_','_','_','_','0'},
	 {'_','_','_','_','_','0','_','0','_','_'},
	 {'_','0','_','_','_','_','_','_','_','0'},
};

// Базовое победное поле для level1
char winfield[10][10]= {
	 {'0','_','+','0','+','0','_','+','0','+'},
	 {'+','_','_','_','_','_','_','_','_','_'},
	 {'0','+','0','+','_','+','_','0','+','0'},
	 {'_','_','+','0','+','0','_','+','_','+'},
	 {'+','_','_','_','_','_','_','_','_','0'},
	 {'0','_','+','_','+','0','_','+','_','_'},
	 {'+','_','0','+','0','+','_','0','_','+'},
	 {'0','+','_','_','_','_','_','+','_','0'},
	 {'_','_','_','_','+','0','+','0','_','+'},
	 {'+','0','+','_','_','_','_','+','_','0'},
};

// Основная функция
int main(){
    setlocale(LC_ALL, "RUS");
    printf("Головоломка 'Кривая дорожка'. Студент Крысанов Ярослав Константинович, группа бИСТ - 231\n\n");
    levelchoice();   //Вызов функции выбора поля
    printf("Для изменения цвета клетки введите её координаты\n");
    
    // Бесконечный цикл для решения поля
    for (;;){
        writ();   //вывод поля на экран
        if(changes() == 1){break;} // Завершение программы в случае ввода -1
        if(win() == 1){break;}    // Завершение программы при победе
    }
    return 0;
}
// Функция стандартного поля
void level1(char matrix[10][10]){
   for (int i = 0; i < 10; i++){
      for (int j = 0; j < 10; j++){
         matrix[i][j] = stanfield[i][j];  //Перенос значений из стандартного поля в рабочий 
      }
   }
}

// Функция чтения поля из файла
int level2(char matrix[10][10]){
   FILE *source = fopen("source.txt", "r"); // открытие файла в режиме чтения
   if (source == NULL) {    //проверка правильного открытия
      perror("Ошибка открытия файла");
      return 0;
   }
   for (int i = 0; i < 10; i++){
      for (int j = 0; j < 10; j++){
         fgets(&matrix[i][j], 2, source); // Перенос значений в рабочее поле
      }
   }
   fseek(source, 0, SEEK_END);
   if (ftell(source) <= 0){  //Проверка на наличие поля в файле
      printf("Файл пуст. Создайте новое поле в режиме 3\n");
      return 0;
   }
   fclose(source);
   return 1;
}

// Функция создания нового поля
void level3(char matrix[10][10]) {
    char line[11];
    printf("Вы перешли в режим создания нового поля\nДалее вводите каждую строку последовательно, без пробелов\n");
    FILE *source = fopen("source.txt", "w"); //открытие файла в режиме записи
    if (source == NULL) {    //проверка правильного открытия
        perror("Ошибка открытия файла");
        return; 
    }
    for (int i = 0; i < 10; i++) {     //запись пользовательских значений
        if (fgets(line, sizeof(line), stdin) == NULL) {break;}
        if (strlen(line) < 10) {
            printf("Строка должна содержать не менее 10 символов.\n");
            i--; 
            continue;
        }
        fprintf(source, "%s", line);
        for (int j = 0; j < 10; j++) {
            matrix[i][j] = line[j];
        }
    }
    fclose(source);
    printf("Ваше поле успешно записано\n");
}

// Функция для проверки безопасности установки '0' в клетке
int isSafe(char matrix[10][10], int row, int col) {
    if (row > 0 && matrix[row - 1][col] == '0')
        return 0;
    else if (row < 10 - 1 && matrix[row + 1][col] == '0')
        return 0;
    else if (col > 0 && matrix[row][col - 1] == '0')
        return 0;
    else if (col < 10 - 1 && matrix[row][col + 1] == '0')
        return 0;
    return 1;
}

// Функция случайлой генерации поля
void level4(char matrix[10][10]) {
    srand((unsigned int)time(NULL)); 
    int counter = 0, numZeros;
    printf("Введите сложность\n1 - Легко\n2 - Средне\n3 - Сложно\n");
    scanf("%i", &numZeros);
    numZeros = numZeros * 7; // выбор сложности
    while (counter < numZeros) {
        int row = rand() % 10;
        int col = rand() % 10;
        if (matrix[row][col] == '_' && isSafe(matrix, row, col)) {
            matrix[row][col] = '0';
            counter++;
        }
    }
    FILE *source = fopen("source.txt", "w");   //запись поля в файл
    for (int i = 0; i < 10; i++){
      for (int j = 0; j < 10; j++){
         fprintf(source, "%c", matrix[i][j]);
      }
    }
    fclose(source);
    printf("Ваше поле успешно записано\n");
}

// Функция выбора поля 
void levelchoice(){
   int level;
   printf("Добро пожаловать в игру 'Кривая дорожка'!\nВыберите поле для игры или создайте новое:\n1 - Стандартное\n2 - Взять из файла\n3 - Создать новое\n4 - Создать случайное\n");
   scanf("%i", &level);
   // Бесконечный цикл для обработки ввода пользователя
   for (;;){
      switch (level) {
        case 1:
            level1(field);
            break;
        case 2:
            if (level2(field) != 0){break;}
        case 3:
            level3(field);
            break;
        case 4:
            level4(field);
            break;
        default:
            printf("Неверный код режима\n");
            scanf("%i", &level);
            continue; 
      }
      break;
   }
}

// Функция для проверки победы
int win(){
   int count = 0;
   for(int i = 0; i < 10; i++){
      for(int j = 0; j < 10; j++){
         if (field[i][j] == winfield[i][j]){
            count++;
         } else {
            break;
         }
      }
   }
   if (count == 100){
      printf("Вы победили\n");
      return 1;
   } else {
      count = 0;
   }
   return 0;
}

// Функция внесения изменений в поле в соответствии с введенными координатами
int changes(){
   printf("Введите координаты или -1 для выхода\n");
   scanf("%i %i", &x, &y);
   if (x == -1 || y == -1){
      return 1; // Завершение игры при вводе -1
   }
   if (field[x][y] != '0'){  //проверка на ввод неправильных координат
      if (field[x][y] == '_'){
         field[x][y] = '+';
      } else {
         field[x][y] = '_';
      }
   } else {
      printf("Невозможно изменить значение\n");
   }
   return 0;
}

// Функция вывода текущего состояния поля на экран
void writ(){
   printf("    0 1 2 3 4 5 6 7 8 9 \n");
   printf("   ____________________\n");
   for(int i = 0; i < 10; i++){
      printf("%i |", i);
      for(int j = 0; j < 10; j++){
         printf(" %c", field[i][j]);
      }
      printf("\n");
   }
}